In [1]:
import numpy as n 
import pandas as p

In [2]:
england = { 'club':['Arsenal','Man City', 'Liverpool'], 'name':['M.Odegard', 'KDB','M.Salah']}

In [3]:
europe = { 'club':['Real M', 'Barselona', 'PSG', 'Bayern'], 'name':['Mbappe','Yamal','Dembele','Kein']}

In [4]:
eng = p.DataFrame(england)

In [5]:
eu = p.DataFrame(europe)

In [6]:
eng

        club       name
0    Arsenal  M.Odegard
1   Man City        KDB
2  Liverpool    M.Salah

In [7]:
eu

        club     name
0     Real M   Mbappe
1  Barselona    Yamal
2        PSG  Dembele
3     Bayern     Kein

In [8]:
p.merge(eu,eng, how='outer',on='name')

      club_x       name     club_y
0        PSG    Dembele        NaN
1        NaN        KDB   Man City
2     Bayern       Kein        NaN
3        NaN  M.Odegard    Arsenal
4        NaN    M.Salah  Liverpool
5     Real M     Mbappe        NaN
6  Barselona      Yamal        NaN

In [9]:
p.merge(eu,eng, how='outer',on='club') # it goes from alfavite

        club   name_x     name_y
0    Arsenal      NaN  M.Odegard
1  Barselona    Yamal        NaN
2     Bayern     Kein        NaN
3  Liverpool      NaN    M.Salah
4   Man City      NaN        KDB
5        PSG  Dembele        NaN
6     Real M   Mbappe        NaN